Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: `angle` returns the phase angle in radians (also known as the argument or arg function).
ja: '角度は位相角をラジアン単位で返します。 (引数またはarg関数とも呼ばれます)。

source: DefaultArrayStyle and the abstract supertype, AbstractArrayStyle, store the dimensionality as a type parameter to support specialized array types that have fixed dimensionality requirements.
ja: DefaultArrayStyleと抽象型スーパータイプAbstractArrayStyleは、特殊化されたものをサポートするために、次元をタイプパラメータとして格納します。 固定された次元要件を持つ配列タイプ。

source: Priv is a private package that you created, whereas Pub is a public package that you use but don't control.
ja: Privは、作成したプライベート・パッケージですが、Pubは使用するパブリック・パッケージですが、制御することはできません。

source: `AbstractVector` and `AbstractMatrix` are aliases for the 1-d and 2-d cases.
ja: 'AbstractVector'および'AbstractMatrixは 1-dおよび2-dケースのエイリアス。

source: compare is a callback function which takes pointers to two elements a and b and returns an integer less/greater than zero if a should appear before/after b (or zero if any order is permitted).
ja: 比較は、2つの要素aとbとbのポインタを取得するコールバック関数であり bの前/後b(いずれかの順序がある場合は0)の前にaを表示する必要がある場合は、0より小さい/大きい整数 が許可されています。

source: new{T,S} can be used in any constructor definition, but for convenience the parameters to new{} are automatically derived from the type being constructed when possible.
ja: 新しい{T,S}は、任意のコンストラクタ定義で使用できますが、便宜上、パラメータを使用します。 新しい{}は、可能な場合に構築されているタイプから自動的に導出されます。

source: `view` stores the input index vectors in a SubArray object, which can later be used to index the original array indirectly.
ja: 'view'は、入力インデックスベクトルを サブアレイオブジェクトで、後でオリジナルの配列をインデックス化するために使用できます。 間接的に。

source: = is ignored by bash since it stops parsing the file once it reaches to the exec statement.
ja: =は、bashによって無視されます。なぜならば、それは停止するからです。 execステートメントに到達したファイルを解析します。

source: A great deal of care has been taken to ensure that Julia does them correctly.
ja: Juliaでは、このような処理を正確に実施できるよう、細心の注意が払われています。

source: A "strided" array is stored in memory with elements laid out in regular offsets such that an instance with a supported isbits element type can be passed to external C and Fortran functions that expect this memory layout.
ja: "stried"配列は、規則的なオフセットに配置された要素を含むメモリに格納されます。 サポートされるイスビトスエレメントタイプを持つインスタンスは このメモリレイアウトを期待する外部CとFortranの関数です。

source: A (:function, "library") pair, which must be written as a literal constant,
ja: (:関数、"ライブラリ")ペアで、リテラル定数として記述される必要があります。

source: A (name, library) function specification must be a constant expression.
ja: (名前、ライブラリ)関数仕様は、定数式でなければなりません。

source: A Char value represents a single character: it is just a 32-bit primitive type with a special literal representation and appropriate arithmetic behaviors, and which can be converted to a numeric value representing a Unicode code point.
ja: Char 値は単体の文字を表します。これは特殊なリテラル表現と適切な算術演算を持つ32ビットのプリミティブタイプであり、 数値は Unicode code pointUnicodeコードポイント として解釈されます。

source: A Char value represents a single character: it is just a 32-bit primitive type with a special literal representation and appropriate arithmetic behaviors, whose numeric value is interpreted as a Unicode code point.
ja: Char 値は単体の文字を表します。これは特殊なリテラル表現と適切な算術演算を持つ32ビットのプリミティブタイプであり、 数値は Unicode code pointUnicodeコードポイント として解釈されます。 C

source: A break statement inside such a loop exits the entire nest of loops, not just the inner one.
ja: このようなループ内のbreakステートメントは、内部だけではなくループのネスト全体を終了させます。

source: A package is a source tree with a standard layout providing functionality that can be reused by other Julia projects.
ja: パッケージは、他のジュリアプロジェクトによって再利用可能な機能を提供する標準的なレイアウトを備えたソースツリーです。

source: A MethodError should be thrown if x cannot be displayed as that MIME type; this is automatic if one calls show or repr.
ja: xが表示されない場合は、MethodErrorをスローする必要があります。 このMIMEタイプは、<X21/>showまたはreprを呼び出すと自動的に表示されます。

source: A SubArray
ja: サブアレイ

source: A Julia Function
ja: ジュリア関数

source: A classic example is `map()`, which applies a function to each value of an array and returns a new array containing the resulting values:
ja: 定番の例としては、`map()`があります。 この関数は、 配列の各要素に関数を適用したものを、新しい配列として返します。

source: A classic example is the standard C library qsort function, declared as:
ja: 典型的な例として、標準的なCライブラリqsort関数があり、次のように宣言されています。

source: A constructor is just like any other function in Julia in that its overall behavior is defined by the combined behavior of its methods.
ja: コンストラクタは、その全体的な振る舞いが定義されているという点で、Juliaの他の関数と同じです。 それは、その方法の組み合わせによるものである。

source: A convenient syntax for this is X .= ..., which is equivalent to broadcast!(identity, X, ...) except that, as above, the broadcast! loop is fused with any nested "dot" calls.
ja: このための便利な構文はX.=.…である。 は、ブロードキャストと同等であり、ブロードキャスト!は、上記のように、ブロードキャスト!ループを意味します。 ネストされた「ドット」コールと融合されます。

source: A curated list of useful learning resources to help new users get started can be found on the learning page of the main Julia web site.
ja: 新しいユーザを支援するための有用な学習リソースのリストは、Julia Webサイトのlearning ページに掲載されています。

source: A definition of one possible behavior for a function is called a method.
ja: こうした関数の、とるかもしれない１つの動作の定義は、メソッドと呼ばれます。

source: A few general rules to note:
ja: 注意する一般的な規則は次のとおりです。

source: A few special expressions correspond to calls to functions with non-obvious names.
ja: 特殊な式で、分かりづらい名前ながら、関数呼び出しに対応しているものが、いくつかあります。

source: A function `display(x)` to request the richest available multimedia display of a Julia object x (with a plain-text fallback).
ja: Juliaオブジェクトの最もリッチなマルチメディアディスプレイを要求する関数`display(x)` x(プレーンテキストのフォールバックを使用)。

source: A function can also take one or more Expr objects as arguments, and return another Expr.
ja: 関数はまた、一つ以上のExprオブジェクトを引数として取得することもでき、また別のオブジェクトを返すこともできます。 Expr。

source: A function is called using the traditional parenthesis syntax:
ja: 関数は、従来の括弧を使う構文で呼び出されます。

source: A function name may be used alone in place of the tuple (just :function or "function").
ja: 関数の関数名はタプルの代わりに単独で使用することができる(単に:関数または"関数)。

source: A function name may be used alone in place of the tuple (just :function or "function"). In this case the name is resolved within the current process. This form can be used to call C library functions, functions in the Julia runtime, or functions in an application linked to Julia.
ja: タプルの代わりに関数名を使用することができます(単に:関数または"関数<x x/><x/>)。 この場合、現在のプロセス内で名前が解決されます。このフォームを使用してCライブラリを呼び出すことができます。 関数、Juliaランタイム内の関数、またはJuliaにリンクされたアプリケーションの関数です。

source: A key part in defining an AbstractArray subtype is `IndexStyle`.
ja: AbstractArrayサブタイプの定義における重要な部分は'IndexStyleであるである。

source: A literal tuple of input types
ja: 入力タイプのリテラル・タプル

source: A logical index must be a vector of the same length as the dimension it indexes into, or it must be the only index provided and match the size and dimensionality of the array it indexes into.
ja: 論理インデックス は、インデックスを作成する寸法と同じ長さのベクトルである必要があります。また 指定された唯一のインデックスであり にインデックスを作成します。

source: A lot of the power and extensibility in Julia comes from a collection of informal interfaces.
ja: Juliaのパワーと拡張性の多くは、インフォーマルなインターフェースの集合から生まれています。

source: A macro maps a tuple of arguments to a returned expression, and the resulting expression is compiled directly rather than requiring a runtime `eval` call.
ja: マクロマップ 返された式への引数のタプルで、生成された式は直接コンパイルされる。 実行時の`eval'呼び出しを要求するのではありません。

source: A manifest file contains a stanza for each of a project's direct or indirect dependencies, including for each one, its UUID and a source tree hash or an explicit path to the source code.
ja: マニフェスト・ファイルには、各プロジェクトの直接的または間接的依存関係のスタンザが含まれています。たとえば、各プロジェクトのUUIDとソース・ツリーのハッシュまたはソース・コードへの明示的なパスが含まれます。

source: A nested tree of Broadcasted containers is directly constructed by the implicit dot syntax; 5 .+ 2.*x is transiently represented by Broadcasted(+, 5, Broadcasted(*, 2, x)), for example.
ja: ネストされたツリー ブロードキャストコンテナは、暗黙的なドット構文によって構成されます。5.+2.*xは ブロードキャスト(+,5,ブロードキャスト(*, 2, x))などによって一時的に表現される。

source: A notable exception is AbstractString; strings are special-cased to behave as scalars for the purposes of broadcast even though they are iterable collections of their characters (see Strings for more).
ja: 注目すべき例外はAbstractStringです。 文字列は、ブロードキャストの目的で、ブロードキャストのために それらは、それらの文字(詳細はの文字列を参照)のコレクションです。

source: A notable exception is `unsafe_wrap`
ja: 注目すべき例外は、'insafe_wrap'です。

source: A package directory is a directory containing the source trees of a set of packages as subdirectories.
ja: パッケージディレクトリは、サブディレクトリとしてパッケージセットのソースツリーを格納したディレクトリです。

source: A package is loaded by import X or using X statements.
ja: Xステートメントを使用して、インポートXまたはを使用してパッケージをロードします。

source: A package with a project file but no explicit UUID can only be depended on by packages without project files since dummy UUIDs assigned to these packages are strictly internal.
ja: プロジェクトファイルが含まれるが明示的なUUIDはないパッケージは、これらのパッケージに割り当てられたダミーUUIDが厳密に内部的であるため、プロジェクトファイルを含まないパッケージによってのみ依存することができます。

source: A package with a project file cannot depend on one without a project file since packages with project files can only load packages in graph and packages without project files do not appear in graph.
ja: プロジェクトファイルを持つパッケージはグラフでのみロードでき、プロジェクトファイルのないパッケージはグラフにはロードされないため、プロジェクトファイルを持たないパッケージは、プロジェクトファイルなしのものに依存することはありません。

source: A package without a project file can depend on any top-level dependency, and since every package in a package directory is available at the top-level, it can import all packages in the environment.
ja: プロジェクト・ファイルがないパッケージは、最上位の依存関係に依存することができ、パッケージ・ディレクトリ内のすべてのパッケージが最上位レベルで使用可能なので、環境内のすべてのパッケージをインポートできます。

source: A pointer to memory allocated by Julia must be of type Ref{gsl_permutation}, to ensure that the memory address pointed to is valid and that Julia's garbage collector manages the chunk of memory pointed to correctly.
ja: ポインタ Juliaによって割り当てられたメモリは、メモリを確保するためにはRef{gsl_mutation}のようにする必要があります。 指定されたアドレスは有効であり、ジュリアのガーベッジ・コレクターは、指定されたメモリーのチャンクを管理しています。 正確に。

source: A prefix & is used on an argument to `ccall` to indicate that a pointer to a scalar argument should be passed instead of the scalar value itself (required for all Fortran function arguments, as noted above).
ja: プレフィックス&は、スカラーへのポインタを示すために、'ccall'への引数で使用されます。 スカラー値自体の代わりに引数を渡す必要があります(すべてのFortran関数に対して必要です)。 引数は前述のとおりです。

source: A project environment is determined by a directory containing a project file called Project.toml, and optionally a manifest file called Manifest.toml.
ja: プロジェクト環境は、Project.トミルと呼ばれるプロジェクトファイルを含むディレクトリ、およびオプションでマニフェスト.トミルと呼ばれるマニフェストファイルによって決定されます。

source: A project environment is a directory with a project file and an optional manifest file.
ja: プロジェクト環境は、プロジェクトファイルとオプションのマニフェストファイルを持つディレクトリです。

source: A rich language of types for constructing and describing objects, that can also optionally be used to make type declarations
ja: オブジェクトを作成したり説明したりするのに使うことができる、型に関する豊富な機能を提供します。プログラマ自身で型を宣言することもできます

source: A scalar index.
ja: スカラーインデックスです。

source: A scalar index. By default this includes:
ja: スカラー・インデックスです。デフォルトでは、次のようになります。

source: A similar example can be constructed for `@cfunction`.
ja: 同様の例は、`@cfunction`のために構成することができます。

source: A simple example is an iterable sequence of square numbers with a defined length:
ja: 単純な例は、定義された長さの2乗数のiterableシーケンスです。

source: A stacked environment is an ordered set of project environments and package directories, overlaid to make a single composite environment in which all the packages available in its constituent environments are available.
ja: スタック環境は、プロジェクト環境とパッケージディレクトリの順序付きセットで、その構成環境で使用可能なすべてのパッケージが利用可能な単一の複合環境を作成するためにオーバーレイされます。

source: A strided array is a subtype of AbstractArray whose entries are stored in memory with fixed strides.
ja: ストローブされたアレイは、AbstractArrayのサブタイプであり、そのエントリは固定された歩進でメモリ内に格納される。

source: A symbol is an interned string
ja: シンボルは、インターンの文字列です。

source: A symbol representing the operator associativity can also be found by calling the built-in function Base.operator_associativity:
ja: 演算子の自動調整を表すシンボルは、組み込み関数Base.operator_associative:を呼び出すことによっても検出されます。

source: A tuple of input types.
ja: 入力タイプのタプル。

source: A tuple of input types. The input types must be written as a literal tuple, not a tuple-valued variable or expression.
ja: 入力タイプのタプル。入力タイプはタプルではなくリテラル・タプルとして記述される必要があります。 変数または式。

source: A typical example of a user-defined strided array is one that wraps a standard Array with additional structure.
ja: ユーザ定義のストローブ配列の典型的な例は一つです。 これは、標準的なアレイ<x/>を追加の構造でラップします。

source: A typical usage of such a pair of return values, however, extracts each value into a variable.
ja: しかし、このような戻り値の典型的な使用法は、それぞれの値を変数に抽出することです。

source: A variable, in Julia, is a name associated (or bound) to a value.
ja: Juliaにおける変数は、値に関連（または紐づく）する名前になります。

source: A way to determine that a file is run in this fashion is to check if abspath(PROGRAM_FILE) == @__FILE__ is true.
ja: ファイルが実行されることを判別する方法 この方法は、アブスパス(PROGRAM_FILE)==@_FILE__が真であるかどうかをチェックすることです。

source: A zero-argument anonymous function is written as ()->3.
ja: 引数が０個の場合は()->3.のように書きます。

source: A is overwritten with the value X[i_1, i_2, ..., i_n].
ja: は、X[i_1,i_2,…,i_n]の値で上書きされる。

source: A is overwritten with the value X[i_1, i_2, ..., i_n]. If X is not an array, its value is written to all referenced locations of A.
ja: は値X[i_1,i_2,…i_n]で上書きされます。Xが配列でない場合、その値はその値を返します。 は、Aの参照されたすべての場所に書き込まれます。

source: Aardvark can import on any of Bobcat, Cobra or Dingo; it does import Bobcat and Cobra.
ja: ツチブタは、ボブキャット、Cobra、またはディンゴのいずれかにインポートできます。また、ボブキャットとCobraをインポートします。

source: Accessing Data through a Pointer
ja: ポインタを介してデータにアクセスする

source: Accessing Global Variables
ja: グローバル変数へのアクセス

source: Accordingly, in Julia, these behaviors all belong to a single object: the + function.
ja: したがって、Juliaでは、これらの挙動はすべて1つのオブジェクト「+関数」に属します。

source: Accordingly, you can add functionality to a constructor by simply defining new methods.
ja: したがって、コンストラクタに機能を追加することができます。 新しい方法を定義することです。

source: Adding an integer to a Ptr in Julia always moves the pointer by some number of bytes, not elements.
ja: ジュリアのPtrに整数を追加すると、常にポインタがいくつかの数だけ移動します。 バイトで、要素ではありません。

source: Adding parentheses lets us add a third argument to `map`:
ja: 括弧を追加すると 'map`:に3番目の引数を追加します。

source: Addition
ja: 加算

source: Additional convenience constructor methods, supplying default values or auxiliary transformations, should be provided as outer constructors that call the inner constructors to do the heavy lifting.
ja: 追加 便利なコンストラクタメソッド、デフォルト値または補助変換を提供する必要があります。 内部コンストラクタを呼び出す外部コンストラクタとして提供され、このコンストラクタは重いリフティングを実行します。

source: Additional discussion of other encodings and how to implement support for them is beyond the scope of this document for the time being.
ja: その他のエンコーディングとその実装方法は当ドキュメントの対象外となります。

source: Additional functionality is available from a growing collection of available packages.
ja: その他の機能は、利用可能なパッケージのコレクションから入手できます。

source: Additionally, there is a macro @static which makes it possible to use these functions to conditionally hide invalid code, as demonstrated in the following examples.
ja: さらに マクロ@staticがあるため、これらの関数を使用して条件付きで非表示にすることができます。 次の例で示されているように、無効なコードです。

source: Additionally, `broadcast` is not limited to arrays (see the function documentation), it also handles tuples and treats any argument that is not an array, tuple or `Ref`
ja: さらに、`broadcast'は配列に限定されるものではありません(関数の文書を参照してください)。 また、タプルや、配列ではない引数、タプル、`Ref"を処理することもできません。

source: Additionally, `sinpi(x)` and `cospi(x)` are provided for more accurate computations of `sin(pi*x)` and `cos(pi*x)` respectively.
ja: さらに、`sinpi(x)` および`cospi(x)`は、より正確な `sin(pi*x)` および `cos(pi*x)`の計算のために提供されています。

source: Additionally, Julia provides software support for Arbitrary Precision Arithmetic, which can handle operations on numeric values that cannot be represented effectively in native hardware representations, but at the cost of relatively slower performance.
ja: さらに、Juliaは、 使用しているハードウェアでは効果的に表現できない数値の演算処理を行うことができる 任意精度計算 の ソフトウェアサポートを提供します。

source: Additionally, full support for Complex and Rational Numbers is built on top of these primitive numeric types.
ja: 加えて、>複素数と有理数 へのサポートは、これらの数値プリミティブ型を踏まえて構築されています。

source: Additionally, parenthesized expressions can be used as coefficients to variables, implying multiplication of the expression by the variable:
ja: さらに、括弧で括られた表現は変数の係数として使用され、乗算を意味します。 変数による表現は次のようになります。

source: Additionally, some exception types take one or more arguments that are used for error reporting:
ja: また、いくつかの例外タイプには、エラー報告に使用される一つ以上の引数があります。

source: Additionally, to support the syntax S[end], we must define `lastindex` to specify the last valid index.
ja: さらに、構文S[end]をサポートするためには、最後の値を指定するために`lastindex'を定義する必要があります。 有効なインデックスです。

source: After the identity of X in import X has been resolved to a UUID via roots or graph (depending on whether it is loaded from the main project or a dependency), Julia determines what file to load to acquire X by looking up paths[uuid,:X] in the environment.
ja: のインポートXのXのIDは、ルートまたはグラフ(主プロジェクトからロードされるか依存性からロードされるかによって異なります)を介してUUIDに分解された後、のパス[uuid,:X]を検索してXを取得することによって、ロードするファイルを決定します。

source: All comma-separated expressions after for are interpreted as ranges.
ja: のためにの後にコンマで区切られたすべての式は、範囲として解釈されます。

source: All comma-separated expressions after for are interpreted as ranges. Adding parentheses lets us add a third argument to `map`:
ja: での後にカンマで区切られたすべての式は、範囲として解釈されます。括弧を追加すると 'map`:に3番目の引数を追加します。

source: All dimensions indexed with scalars are dropped.
ja: スカラーでインデックス付けされたすべての次元は削除されます。

source: All indexing in Julia is 1-based: the first element of any integer-indexed object is found at index 1.
ja: Julia のインデックスは全て1から始まります。つまり、整数インデックスを持つオブジェクトの最初の要素のインデックスは1になります。

source: All numeric types interoperate naturally without explicit casting, thanks to a flexible, user-extensible (@ref conversion-and-promotion).
ja: 全ての数値型は、明示的に割り当てることなく自然に相互運用します。(@ref conversion-and-promotion)

source: All numeric types interoperate naturally without explicit casting, thanks to a flexible, user-extensible type promotion system.
ja: すべての数値型は、 柔軟なユーザー拡張可能なtype promotion system のおかげで、明示的なキャストなしで自然に相互運用されます。

source: All other types are stored as a pointer to the data.
ja: 他のすべてのタイプはポインタとして保存されます。 データに変換します。

source: All string types are subtypes of the abstract type AbstractString, and external packages define additional AbstractString subtypes (e.g. for other encodings).
ja: すべての文字列型は抽象型 AbstractString のサブタイプであり、外部パッケージは追加のAbstractString のサブタイプ（例えばその他のエンコーディング用） を定義します。文

source: All the looping is performed compile-time, and we avoid looping during execution entirely.
ja: すべてのループはコンパイル時に実行されます。 実行中のループを完全に回避することができます。

source: All the sorting and order related functions rely on a "less than" relation defining a total order on the values to be manipulated.
ja: ソートと順序の関連関数はすべて、合計オーダーを定義する「より少ない」リレーションに依存しています。 操作する値を指定します。

source: All the standard trigonometric and hyperbolic functions are also defined:
ja: 標準的な全ての三角関数と双曲線関数も定義されています。:

source: Alright, now that we have a better understanding of how generated functions work, let's use them to build some more advanced (and valid) functionality...
ja: 分かりました、生成された関数がどのように機能するかをよく理解してから、それを使ってみましょう。 より高度な(かつ有効な)機能を構築するために。。。

source: Also in and isa are parsed as infix operators.
ja: では、ではであるは、インフィックス演算子として解析されます。

source: Also notice the difference between max.(a,b), which `broadcast`s `max`
ja: また、の最大値(a,b)は、"ブロードキャスト""max""max'の差があることに注意してください。

source: Also recommended is Bruce Dawson's series of blog posts on floating-point numbers.
ja: Bruce Dawsonによる浮動小数点数に関する一連のブログ記事もお勧めします。

source: Also, every binary operator supports a (@ref man-dot-operators) that can be applied to arrays (and combinations of arrays and scalars) in such (@ref man-vectorized), e.g. z .== sin.(x .* y).
ja: また、バイナリ演算子のは、(@ref man-dot-operators)をサポートします。 は、配列(および配列とスカラーの組み合わせ)に適用することができます。 (@ref man-vectorized)、例えばz.=sin.(x .* y)。

source: Also, note that there is no compatibility layer that ensures the intrinsic makes sense and works on the current target, unlike the equivalent Julia functions exposed by Core.Intrinsics.
ja: また、固有のmakeを確実にする互換性レイヤーは存在しないことに注意してください。 現在の目標を意識して これは、コアによって露出される同等のジュリア関数とは異なります。inintrics.

source: Also, when calling a Fortran function, all inputs must be passed as pointers to allocated values on the heap or stack.
ja: また、Fortran関数を呼び出す場合は、すべての入力を次のように指定する必要があります。 ヒープまたはスタック上の割り当てられた値へのポインタ。

source: Alternatively, using Module will import all exported Module functions into the current namespace.
ja: あるいは、モジュールを使用するは、エクスポートされたすべてのモジュール関数を現在の名前空間にインポートします。

source: Alternatively, the precision or the rounding can be changed only within the execution of a particular block of code by using the same functions with a do block:
ja: また、コード内の特定のブロックのみの精度や端数処理の変更をしたい場合は、 do ブロックを併用することで設定が可能です。:

source: Alternatively, you can use julia -e 'include(popfirst!(ARGS))' file.jl to execute a script while being able to catch InterruptException in the `try` block.
ja: または、julia-e'include(ポプファースト!(ARGS))'を使用することもできます。 ファイル.jlを実行すると、スクリプトをキャッチしながらスクリプトを実行することができます。 'try'ブロックでInterruptException。

source: Although it is generally a good idea to return a fully initialized object from an inner constructor, it is possible to return incompletely initialized objects:
ja: 一般的には、内部コンストラクタから完全に初期化されたオブジェクトを返すことは、良い考えです。 不完全に初期化されたオブジェクトを返すことができます。

source: Although it is typical, there is no requirement that begin blocks be multiline or that (;) chains be single-line:
ja: beginブロックは複数行で、セミコロン(;)連鎖は単一行で使うのが一般的ですが、これに従う必要はありません。

source: Although it seems a simple concept, multiple dispatch on the types of values is perhaps the single most powerful and central feature of the Julia language.
ja: 単純な考え方のように見えますが、値型に対する多重ディスパッチは、おそらくJulia言語の最も強力で中心的な機能です。

source: Although one sometimes speaks of dynamic languages as being "typeless", they are definitely not: every object, whether primitive or user-defined, has a type.
ja: 動的言語は「型がない」と言われることがありますが、そんなことはありません。 プリミティブであれユーザー定義であれ、全てのオブジェクトは何らかの型を持ちます。

source: Although one sometimes speaks of dynamic languages as being “typeless”, they are definitely not: every object, whether primitive or user-defined, has a type.
ja: 動的言語は「型がない」と言われることがありますが、そんなことはありません。 プリミティブであれユーザー定義であれ、全てのオブジェクトは何らかの型を持ちます。

source: An environment determines what import X and using X mean in various code contexts and what files these statements cause to be loaded.
ja: 環境は、XのインポートXおよびを、さまざまなコードコンテキストでX平均を使用して決定し、これらの文がロードするファイルを決定します。

source: An anonymous function accepting multiple arguments can be written using the syntax (x,y,z)->2x+y-z.
ja: 無名関数が複数の引数をとる場合は、(x,y,z)->2x+y-zのように書きます。

source: An array is a collection of objects stored in a multi-dimensional grid.
ja: 配列は、多次元グリッドに格納されたオブジェクトの集合です。

source: An array of scalar indices.
ja: スカラー・インデックスの配列です。

source: An array of scalar indices. This includes:
ja: スカラー・インデックスの配列です。これには次のようなものがあります。

source: An array with a specific element type can be constructed using the syntax T[A, B, C, ...].
ja: 特定の要素タイプを持つ配列は、構文T[A,B,C,…]を使用して構築することができます。

source: An array with a specific element type can be constructed using the syntax T[A, B, C, ...]. This will construct a 1-d array with element type T, initialized to contain elements A, B, C, etc. For example, Any[x, y, z] constructs a heterogeneous array that can contain any values.
ja: 特定のエレメントタイプを持つ配列は、構文T[A,B,C,…]を使用して構築できます。 要素タイプTを持つ1dアレイを構築し、要素A、B、Cを含むように初期化します。 たとえば、任意の[x,y,z]は、任意の値を含むことができる異機種間配列を構成します。

source: An environment's graph is a multilevel map which assigns, for each context UUID, a map from names to UUIDs, similar to the roots map but specific to that context.
ja: 環境のグラフは、の各コンテキストUUIDに対して、名前からUUIDへのマップを割り当てます。は、マップと同様に、のコンテキストに特有です。

source: An environment's roots map assigns package names to UUIDs for all the top-level dependencies that the environment makes available to the main project (i.e. the ones that can be loaded in Main).
ja: 環境のルートマップは、環境が主プロジェクトで利用可能なすべてのトップレベル依存関係(すなわち、メインにロード可能なもの)に対して、UUIDにパッケージ名を割り当てます。

source: An example of this is matrix addition, where A + B == B + A for any matrices A and B
ja: 例えば行列の加算は、A + B == B + A は A と Bが同じサイズで有る限り成り立つ可換演算です。
